{
  "What are the data types in javascript?": "String, Object, Boolean, Number, null, undefined, Symbol(ES6)",
  "Define a string in javascript": "A string in JavaScript must be surrounded by quotes (single, double, backticks)\nEx: let str = \"Hello\";\nlet str2 = 'Single quotes are ok too';",
  "Define a boolean in javascript": "The boolean type has only two values: true and false.\nThis type is commonly used to store yes/no values: true means \"yes, correct\", and false means \"no, incorrect\".",
  "Define null in javascript": "In JavaScript, null is not a “reference to a non-existing object” or a “null pointer” like in some other languages.\nIt's just a special value which represents \"nothing\", \"empty\" or \"value unknown\".",
  "Define undefined in javascript": "The special value undefined also stands apart. It makes a type of its own, just like null.\nThe meaning of undefined is “value is not assigned”.\nIf a variable is declared, but not assigned, then its value is undefined",
  "What is a function declaration": "The function keyword goes first, then goes the name of the function, then a list of parameters between the parentheses (empty in the example above) and finally the code of the function, also named \"the function body\", between curly braces\n",
  "What is a function expression": "The function is created and assigned to a variable explicitly, like any other value. No matter how the function is defined, it’s just a value stored in a variable.",
  "What is the name of the String function to return the string as parts in an array?": "split",
  "What is an anonymous function?": "A function that is dynamically declared at runtime. They aren't given a name in the same way as normal functions.",
  "What is hoisting in javascript?": "On runtime, all var and function declarations are moved to the beginning of each function (its scope) - this is known as Hoisting. Having said so, it is a good practice to declare all the vars altogether on the first line, in order to avoid false expectations with a var that got declared late but happened to hold a value before - this is a common problem for programmers coming from languages with block scope.",
  "What is recursion?": "Recursion is a programming pattern that is useful in situations when a task can be naturally split into several tasks of the same kind, but simpler. Or when a task can be simplified into an easy action plus a simpler variant of the same task. Or, as we’ll see soon, to deal with certain data structures.\nWhen a function solves a task, in the process it can call many other functions. A partial case of this is when a function calls itself. That’s called recursion.",
  "Explain the Array methods pop, push & shift, unshift": "Pop - remove the last element from an array, altering the original array, return the value.\nPush - add a new element to the end of an array.\nShift - remove the first element from an array, altering the original array, return the element.\nUnshift - add a value to the beginning of an array."
}